cf_billing/InformationRegisters/КассоваяСмена.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КассоваяСмена</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусСмены</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Кассир</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/Enums/ТипыПодключаемогоОборудования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыПодключаемогоОборудования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СканерШтрихкода</Name>
					<Comment>Scanner</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СчитывательМагнитныхКарт</Name>
					<Comment>MSR</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ККТ</Name>
					<Comment>KKT</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФискальныйРегистратор</Name>
					<Comment>FiscalPrinter</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринтерЧеков</Name>
					<Comment>ReceiptPrinter</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДисплейПокупателя</Name>
					<Comment>LineDisplay</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТерминалСбораДанных</Name>
					<Comment>DataCollectionTerminal</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭквайринговыйТерминал</Name>
					<Comment>AcquiringTerminal</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭлектронныеВесы</Name>
					<Comment>Scale</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ККМOffline</Name>
					<Comment>ECROffline</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВесыСПечатьюЭтикеток</Name>
					<Comment>ScaleOffline</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>WebСервисОборудование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ККМОфлайн</Name>
					<Comment>ECROffline</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринтерЭтикеток</Name>
					<Comment>LabelPrinter</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СчитывательRFID</Name>
					<Comment>RFID</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьWebСервисОборудование</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf_billing/Enums/СтатусыКассовойСмены.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыКассовойСмены</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Открыта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыта</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf_billing/CommonModules/ПодключаемоеОборудованиеВызовСервера/Ext/Module.bsl
#Область ПроцедурыИФункцииРаботыСШтрихкодами

// Определить тип штрихкода по значению.
//
Функция ОпределитьТипШтрихкода(Штрихкод) Экспорт
	
	ТипШтрихкода = ПланыВидовХарактеристик.ТипыШтрихкодов.ПустаяСсылка();
	ТипШтрихкодаВрем = МенеджерОборудованияВызовСервера.ОпределитьТипШтрихкода(Штрихкод);
	
	Если ТипШтрихкодаВрем = "EAN8" Тогда
		ТипШтрихкода = ПланыВидовХарактеристик.ТипыШтрихкодов.EAN8;
	ИначеЕсли ТипШтрихкодаВрем = "EAN13" Тогда
		ТипШтрихкода = ПланыВидовХарактеристик.ТипыШтрихкодов.EAN13;
	ИначеЕсли ТипШтрихкодаВрем = "EAN128" Тогда
		ТипШтрихкода = ПланыВидовХарактеристик.ТипыШтрихкодов.EAN128;
	ИначеЕсли ТипШтрихкодаВрем = "CODE39" Тогда
		ТипШтрихкода = ПланыВидовХарактеристик.ТипыШтрихкодов.CODE39;
	ИначеЕсли ТипШтрихкодаВрем = "CODE128" Тогда
		ТипШтрихкода = ПланыВидовХарактеристик.ТипыШтрихкодов.CODE128;
	КонецЕсли;
	
	Возврат ТипШтрихкода;
	
КонецФункции

// Функция возвращает результат поиска по штрихкоду в справочнике Номенклатура.
//
// Параметры:
// ШКод - Строка - проверяемый штрихкод.
// ТольКод - Булево - признак изменения текста запроса.
//
// Возвращаемое значение зависит от входного параметра ТолькоКод:
//
//   ТолькоКод = Ложь:
//    ТаблицаЗначений - колонки: Номенклатура, Цена, ЕдиницаИзмерения, Весовой.
//
//   ТолькоКод = Истина
//    ТаблицаЗначений - колонки: Код.
//
Функция ПоискПоШтрихкоду(ШКод, ТолькоКод = Ложь) Экспорт
	
	ТипШК = ОпределитьТипШтрихкода(ШКод);
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Штрихкоды.Владелец КАК Номенклатура,
	|	СпрНоменклатура.Цена,
	|	СпрНоменклатура.ЕдиницаИзмерения,
	|	СпрНоменклатура.Весовой,
	|	СпрНоменклатура.Характеристика,
	|	СпрНоменклатура.СтавкаНДС
	|ИЗ
	|	Справочник.Номенклатура КАК СпрНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Штрихкоды КАК Штрихкоды
	|		ПО (Штрихкоды.Владелец.Ссылка = СпрНоменклатура.Ссылка)
	|ГДЕ
	|	Штрихкоды.ТипШтрихкода = &ТипШК
	|	И Штрихкоды.Штрихкод = &ШКод";
	
	Если ТолькоКод Тогда
		ЗаменяемыйТекст = "
		|	Штрихкоды.Владелец КАК Номенклатура,
		|	СпрНоменклатура.Цена,
		|	СпрНоменклатура.ЕдиницаИзмерения,
		|	СпрНоменклатура.Весовой,
		|	СпрНоменклатура.Характеристика,
		|	СпрНоменклатура.СтавкаНДС";
		ТекстЗамены = "
		|	СпрНоменклатура.Код";
		Запрос.Текст = СтрЗаменить(Запрос.Текст, ЗаменяемыйТекст, ТекстЗамены);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ТипШК", ТипШК);
	Запрос.УстановитьПараметр("ШКод", ШКод);
	
	Результат = Запрос.Выполнить();
	Возврат Результат.Выгрузить();
	
КонецФункции

// Функция возвращает результат проверки полученного штрихкода на предмет уникальности в информационной базе.
//
// Параметры:
// ШКод - Строка - проверяемый штрихкод.
// ТипШК - ПланВидовХарактеристикСсылка.ТипыШтрихкодов - тип штрихкода.
//
// ВозвращаемоеЗначение:
// Булево - результат проверки.
//
Функция ПроверитьУникальностьШтрихкода(ШКод, ТипШК = Неопределено) Экспорт
	
	Уникальность = Истина;
	Если ТипШК = Неопределено Тогда
		ТипШК = ОпределитьТипШтрихкода(ШКод);
	КонецЕсли;
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	| Штрихкоды.Штрихкод КАК Штрихкод
	|ИЗ РегистрСведений.Штрихкоды КАК Штрихкоды
	|ГДЕ Штрихкоды.Штрихкод = &ШКод
	|И Штрихкоды.ТипШтрихкода = &ТипШК";
	
	Запрос.УстановитьПараметр("ШКод", ШКод);
	Запрос.УстановитьПараметр("ТипШК", ТипШК);
	
	Если Запрос.Выполнить().Выгрузить().Количество() Тогда
		Уникальность = Ложь;
	КонецЕсли;
	
	Возврат Уникальность;
	
КонецФункции

// Функция возвращает результат поиска по регистру сведений Штрихкоды.
//
// Параметры:
// ТекКод - Строка - штрихкод,по которуму производится поиск.
//
// Возвращаемое значение зависит от результат запроса:
//
//   Штрихкод найден:
//    Структура - ключи структуры: Владелец, Штрихкод, ТипШтрихкода.
//
//   Штрихкод НЕ найден:
//    Структура - ключи структуры: Штрихкод, ТипШтрихкода.
//
Функция ПоискПоРегиструСведенийШтрихкоды(ТекКод) Экспорт
	
	ТипШтрихкода = ОпределитьТипШтрихкода(ТекКод);
	Запрос = Новый Запрос();
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Штрихкоды.Владелец КАК Владелец
	|ИЗ
	|	РегистрСведений.Штрихкоды КАК Штрихкоды
	|ГДЕ
	|	Штрихкоды.Штрихкод = &Штрихкод
	|	И Штрихкоды.ТипШтрихкода = &ТипШтрихкода";
	
	Запрос.УстановитьПараметр("Штрихкод", ТекКод);
	Запрос.УстановитьПараметр("ТипШтрихкода", ТипШтрихкода);
	
	СтруктураРезультата = Новый Структура;
	СтруктураРезультата.Вставить("ТипШтрихкода", ТипШтрихкода);
	Выборка = Запрос.Выполнить();
	Если Не Выборка.Пустой() Тогда
		ТекСтрока = Выборка.Выгрузить()[0];
		СтруктураРезультата.Вставить("Владелец", ТекСтрока.Владелец);
	КонецЕсли;
	
	Возврат СтруктураРезультата;
	
КонецФункции

// Демо процедура заполнения структуры прайс-листа при выгрузке методом GetPriceList web-сервиса EquipmentService
// так же используется при выгрузке на ККМ Offline при использовании драйвера 1С:ККМ Offline
// Для заполнения используются подготовленные пустые структуры,
	// Получаемые функциями из модуля МенеджерОборудованияСервисыКлиентСервер.
//
Процедура ЗаполнитьПрайсЛист(ИДУстройства, СтруктураПрайсЛиста) Экспорт
	
	// Пример заполнения:
	// ГРУППЫ ТОВАРОВ
	//Группа1 = МенеджерОборудованияСервисыКлиентСервер.ПолучитьСтруктуруЗаписиМассиваГруппыТоваров();
	//Группа1.Код          = "10001";
	//Группа1.КодГруппы    = "";
	//Группа1.Наименование = "Бытовая техника";
	//СтруктураПрайсЛиста.ГруппыТоваров.Добавить(Группа1);
	//
	//Группа2 = МенеджерОборудованияСервисыКлиентСервер.ПолучитьСтруктуруЗаписиМассиваГруппыТоваров();
	//Группа2.Код          = "10002";
	//Группа2.КодГруппы    = "10001";
	//Группа2.Наименование = "Холодильники";
	//СтруктураПрайсЛиста.ГруппыТоваров.Добавить(Группа2);
	//
	//Группа3 = МенеджерОборудованияСервисыКлиентСервер.ПолучитьСтруктуруЗаписиМассиваГруппыТоваров();
	//Группа3.Код          = "10003";
	//Группа3.КодГруппы    = "10001";
	//Группа3.Наименование = "Телевизоры";
	//СтруктураПрайсЛиста.ГруппыТоваров.Добавить(Группа3);
	//
	//Группа4 = МенеджерОборудованияСервисыКлиентСервер.ПолучитьСтруктуруЗаписиМассиваГруппыТоваров();
	//Группа4.Код          = "10004";
	//Группа4.КодГруппы    = "10001";
	//Группа4.Наименование = "Запасные части";
	//СтруктураПрайсЛиста.ГруппыТоваров.Добавить(Группа4);
	//
	//// ТОВАРЫ
	//
	//// номенклатура без упаковок и характеристик
	//Номенклатура1 = МенеджерОборудованияСервисыКлиентСервер.ПолучитьСтруктуруЗаписиМассиваТовары();
	//Номенклатура1.Наименование = "МИНСК-АТЛАНТ 126";
	//Номенклатура1.Артикул = "МИНСК126";
	//Номенклатура1.Весовой = Ложь;
	//Номенклатура1.ЕдиницаИзмерения = "шт";
	//Номенклатура1.ИмеетУпаковки = Ложь;
	//Номенклатура1.ИмеетХарактеристики = Ложь;
	//Номенклатура1.Код = "11001";
	//Номенклатура1.КодГруппы = "10002";
	//Номенклатура1.СтавкаНДС = "18";
	//Номенклатура1.Услуга = Ложь;
	//Номенклатура1.Цена = "18001.89";
	//Номенклатура1.Штрихкод = "2900001575768";
	//Номенклатура1.Остаток = "13";
	//СтруктураПрайсЛиста.Товары.Добавить(Номенклатура1);
	//
	//// Номенклатура с упаковками, без характеристик
	//Номенклатура2 = МенеджерОборудованияСервисыКлиентСервер.ПолучитьСтруктуруЗаписиМассиваТовары();
	//Номенклатура2.Наименование = "Винт М4х20";
	//Номенклатура2.Артикул = "арт вин";
	//Номенклатура2.Весовой = Ложь;
	//Номенклатура2.ЕдиницаИзмерения = "шт";
	//Номенклатура2.ИмеетУпаковки = Истина;
	//Номенклатура2.ИмеетХарактеристики = Ложь;
	//Номенклатура2.КодГруппы = "10004";
	//Номенклатура2.СтавкаНДС = "18";
	//Номенклатура2.Услуга = Ложь;
	//Номенклатура2.Упаковки = Новый Массив;
	//
	//	// упаковка1
	//	Упаковка1 = МенеджерОборудованияСервисыКлиентСервер.ПолучитьСтруктуруЗаписиМассиваУпаковки();
	//	Упаковка1.Код = "11003";
	//	Упаковка1.Наименование = "Коробка (20шт)";
	//	Упаковка1.Коэффициент = "20";
	//	Упаковка1.Штрихкод = "87987454";
	//	Упаковка1.Цена = "20.15";
	//	Упаковка1.Остаток = "15";
	//	Номенклатура2.Упаковки.Добавить(Упаковка1);
	//	
	//	// упаковка2
	//	Упаковка2 = МенеджерОборудованияСервисыКлиентСервер.ПолучитьСтруктуруЗаписиМассиваУпаковки();
	//	Упаковка2.Код = "11004";
	//	Упаковка2.Наименование = "Коробка (40шт)";
	//	Упаковка2.Коэффициент = "40";
	//	Упаковка2.Штрихкод = "23321212333";
	//	Упаковка2.Цена = "40.15";
	//	Упаковка2.Остаток = "15";
	//	Номенклатура2.Упаковки.Добавить(Упаковка1);
	//	
	//СтруктураПрайсЛиста.Товары.Добавить(Номенклатура2);
	//
	////
	//// Номенклатура с характеристиками, без упаковок
	//
	//Номенклатура3 = МенеджерОборудованияСервисыКлиентСервер.ПолучитьСтруктуруЗаписиМассиваТовары();
	//Номенклатура3.Наименование = "Изолента";
	//Номенклатура3.Артикул = "Изо-125";
	//Номенклатура3.Весовой = Ложь;
	//Номенклатура3.ЕдиницаИзмерения = "шт";
	//Номенклатура3.ИмеетУпаковки = Ложь;
	//Номенклатура3.ИмеетХарактеристики = Истина;
	//Номенклатура3.КодГруппы = "10004";
	//Номенклатура3.СтавкаНДС = "10";
	//Номенклатура3.Услуга = Ложь;
	//Номенклатура3.Характеристики = Новый Массив;
	//
	//	// характеристика1
	//	Характеристика1 = МенеджерОборудованияСервисыКлиентСервер.ПолучитьСтруктуруЗаписиМассиваХарактеристики();
	//	Характеристика1.Код = "11005";
	//	Характеристика1.Наименование = "черная";
	//	Характеристика1.Штрихкод = "2900001575769";
	//	Характеристика1.Цена = "20.15";
	//	Характеристика1.Остаток = "15";
	//	Характеристика1.ИмеетУпаковки = Ложь;
	//	Номенклатура3.Характеристики.Добавить(Характеристика1);
	//	
	//	// характеристика2
	//	Характеристика2 = МенеджерОборудованияСервисыКлиентСервер.ПолучитьСтруктуруЗаписиМассиваХарактеристики();
	//	Характеристика2.Код = "11006";
	//	Характеристика2.Наименование = "синяя";
	//	Характеристика2.Штрихкод = "2900001575770";
	//	Характеристика2.Цена = "20.15";
	//	Характеристика2.Остаток = "15";
	//	Характеристика2.ИмеетУпаковки = Ложь;
	//	Номенклатура3.Характеристики.Добавить(Характеристика2);
	//	
	//СтруктураПрайсЛиста.Товары.Добавить(Номенклатура3);
	//
	//
	//// Номенклатура с характеристиками, с упаковками
	//
	//Номенклатура4 = МенеджерОборудованияСервисыКлиентСервер.ПолучитьСтруктуруЗаписиМассиваТовары();
	//Номенклатура4.Наименование = "Изолента широкая";
	//Номенклатура4.Артикул = "Изо-126";
	//Номенклатура4.Весовой = Ложь;
	//Номенклатура4.ЕдиницаИзмерения = "шт";
	//Номенклатура4.ИмеетУпаковки = Ложь;
	//Номенклатура4.ИмеетХарактеристики = Истина;
	//Номенклатура4.КодГруппы = "10004";
	//Номенклатура4.СтавкаНДС = "10";
	//Номенклатура4.Услуга = Ложь;
	//Номенклатура4.Характеристики = Новый Массив;
	//
	//	// характеристика1
	//	Характеристика1 = МенеджерОборудованияСервисыКлиентСервер.ПолучитьСтруктуруЗаписиМассиваХарактеристики();
	//	Характеристика1.Код = "11005";
	//	Характеристика1.Наименование = "черная";
	//	Характеристика1.ИмеетУпаковки = Истина;
	//	Характеристика1.Упаковки = Новый Массив;
	//	
	//		Упаковка1 = МенеджерОборудованияСервисыКлиентСервер.ПолучитьСтруктуруЗаписиМассиваУпаковки();
	//		Упаковка1.Код = "11003";
	//		Упаковка1.Наименование = "Коробка (20шт)";
	//		Упаковка1.Коэффициент = "20";
	//		Упаковка1.Штрихкод = "87987454у";
	//		Упаковка1.Цена = "20.15";
	//		Упаковка1.Остаток = "15";
	//		
	//		Характеристика1.Упаковки.Добавить(Упаковка1);
	//		
	//Номенклатура4.Характеристики.Добавить(Характеристика1);
	//	
	//	// характеристика2
	//	Характеристика2 = МенеджерОборудованияСервисыКлиентСервер.ПолучитьСтруктуруЗаписиМассиваХарактеристики();
	//	
	//	Характеристика2.Код = "11006";
	//	Характеристика2.Наименование = "синяя";
	//	Характеристика2.Штрихкод = "2900001575770";
	//	Характеристика2.Цена = "20.15";
	//	Характеристика2.Остаток = "15";
	//	Характеристика2.ИмеетУпаковки = Ложь;
	//	
	//Номенклатура4.Характеристики.Добавить(Характеристика2);
	// Демо конец

КонецПроцедуры

// Демо процедура заполнения ответа web-сервиса EquipmentService на вызов метода PostDocs
// В процедуру, через параметр "Документы", передается структура принимаемых документов.
Процедура ЗагрузитьДокумент(ИДУстройства, СтруктураОтвета, Документы) Экспорт
	
	//СтруктураОтвета.Успешно = Истина;
	//СтруктураОтвета.Описание = "Документы успешно загружены";
	//
	//СтруктураОтвета.Успешно = Ложь;
	//СтруктураОтвета.Описание = "Документы не загружены!";
	
КонецПроцедуры

// Демо процедура заполнения массива типов документов, поддерживаемых конфигурацией
// Вызывается методом GetDocTypes web-сервиса EquipmentService
Процедура ЗаполнитьТипыДокументов(МассивТипов) Экспорт
	
	//ТипОтчетОПродажах = МенеджерОборудованияСервисыКлиентСервер.ПолучитьСтруктуруЗаписиМассиваТиповДокументов();
	//ТипОтчетОПродажах.ТипДокумента   = "SalesReport";
	//ТипОтчетОПродажах.МожноПолучать  = Ложь;
	//ТипОтчетОПродажах.МожноЗагружать = Истина;
	//
	//МассивТипов.Добавить(ТипОтчетОПродажах);
	
КонецПроцедуры

// Демо процедура заполнения структуры настроек при выгрузке методом GetSettings web-сервиса EquipmentService
// так же используется при выгрузке на ККМ Offline при использовании драйвера 1С:ККМ Offline
// Для заполнения используются подготовленные пустые структуры,
	// Получаемые функциями из модуля МенеджерОборудованияСервисыКлиентСервер.
//
Процедура ЗаполнитьНастройкиУстройства(ИДУстройства, Настройки) Экспорт
	
	//Настройки.НазваниеОрганизации = "ООО Ромашка";
	//Настройки.ИНН = "123456789012";
	//Настройки.Налогообложение = "Общая";
	//// Настройки.Налогообложение = "Упрощенная";
	//
	//Настройки.ИспользоватьСкидки = Истина;
	//Настройки.ИспользоватьБанковскиеКарты = Истина;

	//
	//ЗаписьВидыОплаты = МенеджерОборудованияСервисыКлиентСервер.ПолучитьСтруктуруЗаписиМассиваВидыОплаты();
	//ЗаписьВидыОплаты.Код = "00000001";
	//ЗаписьВидыОплаты.ТипОплаты = 1;
	//ЗаписьВидыОплаты.Наименование = "Visa";
	//
	//Настройки.ВидыОплаты.Добавить(ЗаписьВидыОплаты);
	//
	//ЗаписьВидыОплаты = МенеджерОборудованияСервисыКлиентСервер.ПолучитьСтруктуруЗаписиМассиваВидыОплаты();
	//ЗаписьВидыОплаты.Код = "00000002";
	//ЗаписьВидыОплаты.ТипОплаты = 1;
	//ЗаписьВидыОплаты.Наименование = "Mastercard";
	//
	//Настройки.ВидыОплаты.Добавить(ЗаписьВидыОплаты);
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункцииРаботыСКодамиМагнитыхКарт

// Функция возвращает результат поиска клиента в справочнике по коду магнитной карты.
//
// Параметры:
// МКод - Строка - магнитный код.
//
// Возвращаемое значение:
// СправочникСсылкаКлиенты / Неопределено.
//
Функция НайтиКлиентаПоМК(МКод) Экспорт
	
	Клиент = Справочники.Клиенты.НайтиПоРеквизиту("НомерКарты", МКод);
	Если Клиент.Пустая() Тогда
		Клиент = Неопределено;
	КонецЕсли;
	Возврат Клиент;
	
КонецФункции

// Функция возвращает результат проверки кода магнитной карты на предмет уникальности в информационной базе.
//
// Если объект уже записан и редактируется, тогда для исключения этого объекта из результат запроса
// добавляется дополнительное условие и устанавливается параметр.
//
// Параметры:
// СпрОбъект - СправочникОбъект.Клиенты - элемент справочника Клиенты.
//
// Возвращаемое значение:
// Булево - результат проверки.
//
Функция ПроверитьУникальностьМагнитногоКода(СпрОбъект) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Текст =
	"ВЫБРАТЬ
	| Клиенты.НомерКарты
	|ИЗ
	| Справочник.Клиенты КАК Клиенты
	|ГДЕ
	|	Клиенты.НомерКарты = &МКод";
	МКод = СпрОбъект.НомерКарты;
	Запрос.УстановитьПараметр("МКод", МКод);
	Если НЕ СпрОбъект.ЭтоНовый() Тогда
		ЭлементСсылка = СпрОбъект.Ссылка;
		Запрос.Текст = Запрос.Текст + " И Клиенты.Ссылка <> &ЭлементСсылка";
		Запрос.УстановитьПараметр("ЭлементСсылка", ЭлементСсылка);
	КонецЕсли;
	Результат = Запрос.Выполнить().Пустой();
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ПроцедурыИФункцииРаботыСФискальнымРегистратором

// Функция возвращает подключенное устройство печати.
//
// Возвращаемое значение:
// Результат - СправочникСсылкаПодключаемоеОборудование.
//
Функция ВернутьИдентификаторУстройстваДляПечатиДокументов() Экспорт
	
	Результат = Справочники.ПодключаемоеОборудование.ПустаяСсылка();
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПодключаемоеОборудование.Ссылка
	|ИЗ
	|	Справочник.ПодключаемоеОборудование КАК ПодключаемоеОборудование
	|ГДЕ
	|	(ПодключаемоеОборудование.ТипОборудования = &ФР
	|			ИЛИ ПодключаемоеОборудование.ТипОборудования = &ПЧ)
	|	И ПодключаемоеОборудование.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("ФР", Перечисления.ТипыПодключаемогоОборудования.ФискальныйРегистратор);
	Запрос.УстановитьПараметр("ПЧ", Перечисления.ТипыПодключаемогоОборудования.ПринтерЧеков);

	Оборудование = Запрос.Выполнить().Выгрузить();
	
	Если Оборудование.Количество() = 1 Тогда
		Результат = Оборудование[0].Ссылка;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции 

// Функция возвращет текущее состояние кассовой смены.
//
// Возвращаемое значение:
// КассоваяСмена - Структура:
//  Ключи структуры:
//   "СтатусСмены" - если не было открыто ни одной смены
//   "СтатусСмены", "Время"
//
Функция ПолучитьСостояниеКассовойСмены() Экспорт
	
	КассоваяСмена = Новый Структура;
	Состояние = РегистрыСведений.КассоваяСмена.СрезПоследних(,Новый Структура("Кассир",Пользователи.ТекущийПользователь()));
	Если Состояние.Количество() = 0 Тогда
		КассоваяСмена.Вставить("СтатусСмены", Перечисления.СтатусыКассовойСмены.Закрыта);
	Иначе
		КассоваяСмена.Вставить("СтатусСмены", Состояние[0].СтатусСмены);
		Кассоваясмена.Вставить("Время", Состояние[0].Период);
	КонецЕсли;
	
	Возврат КассоваяСмена;
	
КонецФункции 

// Функция возвращает результат открытия кассовой смены.
//
// Параметры:
// ОписаниеОшибки - Строка
//
// Возвращаемое значение:
// Результат - Булево
//
Функция ОткрытьКассовуюСмену(ОписаниеОшибки = "") Экспорт
	
	Результат = Истина;
	
	СтруктураСостояниеКассовойСмены = ПолучитьСостояниеКассовойСмены();
	
	ДатаОткрытияКассовойСмены = ТекущаяДатаСеанса();
	Открыта = Перечисления.СтатусыКассовойСмены.Открыта;
	
	Если СтруктураСостояниеКассовойСмены.СтатусСмены = Открыта Тогда
		
		// Если смена открыта, то с момента открытия должно пройти не больше чем 24 часа.
		Если ДатаОткрытияКассовойСмены - СтруктураСостояниеКассовойСмены.Время < 86400 Тогда
			
			// Все в порядке
			
		Иначе
			
			Результат = Ложь;
			// Вероятно, что смена была не закрыта.
			ОписаниеОшибки = НСтр("ru = 'С момента открытия кассовой смены истекло более 24 часов. Необходимо выполнить закрытие кассовой смены.'");
			
		КонецЕсли;
		
	Иначе                
		
		// Смена закрыта. Откроем новую кассовую смену.
		
		НоваяКассоваяСмена = РегистрыСведений.КассоваяСмена.СоздатьМенеджерЗаписи();
		// энргБиллинг
		НоваяКассоваяСмена.Кассир = Пользователи.ТекущийПользователь();
		// энргБиллинг
		НоваяКассоваяСмена.Период = ТекущаяДатаСеанса();
		НоваяКассоваяСмена.СтатусСмены = Открыта;
		НоваяКассоваяСмена.Записать();
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции 

// Функция возвращает результат закрытия кассовой смены.
//
// Параметры:
// ОписаниеОшибки - строка
//
// Возвращаемое значение:
// Результат - Булево
//
Функция ЗакрытьКассовуюСмену(ОписаниеОшибки = "") Экспорт
	
	Результат 						= Истина;
	Закрыта 						= Перечисления.СтатусыКассовойСмены.Закрыта;
	СтруктураСостоянияКассовойСмены = ПолучитьСостояниеКассовойСмены();
	
	Если СтруктураСостоянияКассовойСмены.СтатусСмены = Закрыта Тогда
		Результат 					= Ложь;
	Иначе
		ЗакрытиеСмены 				= РегистрыСведений.КассоваяСмена.СоздатьМенеджерЗаписи();
		ЗакрытиеСмены.Период 		= ТекущаяДатаСеанса();
		ЗакрытиеСмены.Кассир 		= Пользователи.ТекущийПользователь();
		ЗакрытиеСмены.СтатусСмены 	= Закрыта;
		ЗакрытиеСмены.Записать();
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции 

// Функция выбирает чеки, пробитые в текущую смену и присваивает им статус Архивный.
//
// Возвращаеомое значение:
// Результат - Булево - результат записи документов.
//
Функция ЗаархивироватьДокументыПередЗакрытиемСмены() Экспорт
	
	Смена = ПолучитьСостояниеКассовойСмены();
	ДатаНачала = Смена.Время;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДемоЧек.Ссылка
	|ИЗ
	|	Документ.ДемоЧек КАК ДемоЧек
	|ГДЕ
	|	ДемоЧек.Дата > &ДатаНачала";
	
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	ВыборкаДокументов = Запрос.Выполнить().Выгрузить();
	
	Результат = Истина;
	НачатьТранзакцию();
	Для Каждого Документ Из ВыборкаДокументов Цикл
		
		ДокОбъект = Документ.Ссылка.ПолучитьОбъект();
		ДокОбъект.Архивный = Истина;
		
		Попытка
			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
		Исключение
			Результат = Ложь;
			Прервать;
		КонецПопытки;
		
	КонецЦикла;
	
	Если НЕ Результат Тогда
		ОтменитьТранзакцию();
	Иначе
		ЗафиксироватьТранзакцию();
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Получает распределение выручки по секциям фискального регистратора.
//
Функция ПолучитьРаспределениеВыручкиПоСекциям(НастройкаРаспределения) Экспорт

	Результат = Новый Структура;   

	СоответствиеВидовНоменклатурыСекциям = Новый Соответствие();
	Результат.Вставить("СекцияПоУмолчанию", 1);
	Результат.Вставить("СоответствиеВидовНоменклатурыСекциям", СоответствиеВидовНоменклатурыСекциям);

	Распределение = НастройкаРаспределения;

	Если (Распределение = Неопределено) Или (Распределение = Справочники.НастройкиРаспределенияВыручкиПоСекциямФР.ПустаяСсылка()) Тогда
		// Получаем распределение по умолчанию.
		Распределение = Справочники.НастройкиРаспределенияВыручкиПоСекциямФР.РаспределениеПоУмолчанию;
	КонецЕсли;

	Результат.СекцияПоУмолчанию = Распределение.СекцияПоУмолчанию;  
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	
	"ВЫБРАТЬ
	|	РаспределениеВыручкиПоСекциямФР.НомерСекции,
	|	РаспределениеВыручкиПоСекциямФР.ВидНоменклатуры
	|ИЗ
	|	Справочник.НастройкиРаспределенияВыручкиПоСекциямФР.СоответствиеВидовНоменклатурыСекциям КАК РаспределениеВыручкиПоСекциямФР
	|ГДЕ РаспределениеВыручкиПоСекциямФР.Ссылка = &Идентификатор";

	Запрос.УстановитьПараметр("Идентификатор", Распределение.Ссылка);

	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Результат.СоответствиеВидовНоменклатурыСекциям.Вставить(ВыборкаДетальныеЗаписи.ВидНоменклатуры, ВыборкаДетальныеЗаписи.НомерСекции);
	КонецЦикла;

	Возврат Результат;

КонецФункции

// Заполнить cоответствие cекций фискального регистратора для табличной части.
// 
Процедура ЗаполнитьСоответствиеСекцийДляТабличнойЧасти(НастройкаРаспределения, Знач Товары, ТаблицаТоваровСоответствияCекциям) Экспорт
	
	РаспределениеВидовНоменклатурыПоСекциям = ПолучитьРаспределениеВыручкиПоСекциям(НастройкаРаспределения);
	
	Для Каждого СтрокаТЧ Из Товары Цикл
		
		ВидНоменклатуры = СтрокаТЧ.Номенклатура.ВидНоменклатуры;
		Секция = РаспределениеВидовНоменклатурыПоСекциям.СоответствиеВидовНоменклатурыСекциям.Получить(ВидНоменклатуры);
		Если Секция = Неопределено Тогда
			ТаблицаТоваровСоответствияCекциям.Вставить(СтрокаТЧ.НомерСтроки, РаспределениеВидовНоменклатурыПоСекциям.СекцияПоУмолчанию);
		Иначе
			ТаблицаТоваровСоответствияCекциям.Вставить(СтрокаТЧ.НомерСтроки, Секция);
		КонецЕсли
		
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеПроцедурыИФункции

// Функция возвращает результат проверки общей структуры адресов электронной почты клиента
// на корректность записи.
//
// Параметры:
// АдресЭП - Строка - адрес или несколько адресов электронной почты.
//
// Возвращаемое значение:
// Результат - Булево - результат проверки.
//
Функция ПроверитьКорректностьЗаписиАдресаЭлектроннойПочты(АдресЭП) Экспорт
	
	Результат = Истина;
	Если НЕ ПустаяСтрока(АдресЭП) Тогда
		
		ЧислоАдресов = СтрЧислоВхождений(АдресЭП,"@");
		Если ЧислоАдресов = 0 Тогда
			
			Результат = Ложь;
			
		Иначе
			
			Для ккккк = 1 По ЧислоАдресов Цикл
				
				АТ = Найти(АдресЭП, "@");
				
				ИмяПользователя = Лев(АдресЭП,АТ-1);
				
				Если (ПустаяСтрока(ИмяПользователя) ИЛИ Найти(ИмяПользователя," ") <> 0) Тогда
					Результат = Ложь;
					Прервать;
				КонецЕсли;
				
				АдресЭП = Сред(АдресЭП, АТ+1);
				Разделитель = НайтиРазделительАдресов(АдресЭП);
				Если Разделитель = СтрДлина(АдресЭП) Тогда
					Домен = Лев(АдресЭП,Разделитель);
				Иначе
					Домен = Лев(АдресЭП,Разделитель-1);
				КонецЕсли;
				
				Если (ПустаяСтрока(Домен) ИЛИ Найти(Домен," ") <> 0) Тогда
					Результат = Ложь;
					Прервать;
				КонецЕсли;
				
				ЧислоТочек = СтрЧислоВхождений(Домен,".");
				
				Если НЕ (ЧислоТочек > 0 И ЧислоТочек <=2) Тогда
					Результат = Ложь;
					Прервать;
				КонецЕсли;
				
				АдресЭП = СокрЛ(Сред(АдресЭП,Разделитель+1));
				
			КонецЦикла
			
		КонецЕсли;
		
	КонецЕсли;
	Возврат Результат;
	
КонецФункции

// Функция возвращает позицию символа, разделяющего два соседних адреса электронной почты,
// записанных в одной строке.
//
// Параметры:
// Стр - Строка - строка с адресам электронной почты.
//
// Возвращаемое значение:
// Результат - Число - позиция разделителя.
//
Функция НайтиРазделительАдресов(Стр)
	
	Результат = Найти(Стр," ");
	Если Результат = 0 Тогда
		Результат = Найти(Стр,",");
	КонецЕсли;
	Если Результат = 0 Тогда
		Результат = Найти(Стр,";");
	КонецЕсли;
	Если Результат = 0 Тогда
		Результат = СтрДлина(Стр);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Функция возвращает ф.о "Использовать подключаемое оборудование".
//
Функция ИспользоватьПодключаемоеОборудование() Экспорт
	
	Возврат ПолучитьФункциональнуюОпцию("ИспользованиеПодключаемогоОборудования");
	
КонецФункции

// Получить максимальный код SKU.
//
Функция ПолучитьМаксимальныйКодSKU() Экспорт
	
	Текст = "ВЫБРАТЬ
	|	МАКСИМУМ(Номенклатура.SKU) КАК SKU
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура";
	
	Запрос = Новый Запрос(Текст);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Если ЗначениеЗаполнено(Выборка.SKU) Тогда
			Результат = Выборка.SKU + 1;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Функция возвращает первые 50 элементов из справочника Номенклатура.
//
// Возвращаемое значение:
// Результат - ТаблицаЗначений - таблица товаров.
//
Функция ВыбратьДемоДанные() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 50
	|	Номенклатура.Ссылка КАК Номенклатура,
	|	Номенклатура.Характеристика,
	|	Номенклатура.ЕдиницаИзмерения,
	|	Номенклатура.Цена,
	|	Номенклатура.СтавкаНДС,
	|	Номенклатура.Цена КАК Сумма
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.ЭтоГруппа = ЛОЖЬ";
	
	Результат = Запрос.Выполнить().Выгрузить();
	Результат.Колонки.Вставить(6,"Количество");
	Результат.Колонки.Вставить(7,"СуммаНДС");
	
	Для Каждого СтрокаТЗ Из Результат Цикл
		СтрокаТЗ.Количество = 1;
		Ставка = ВернутьСтавкуНДС(СтрокаТЗ.СтавкаНДС);
		Если Ставка <> 0 Тогда
			Сумма = СтрокаТЗ.Сумма;
			СтрокаТЗ.СуммаНДС = Окр(Сумма - Сумма/( 1 + Ставка /100),2);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Функция возвращает значение ставки НДС с типом Число для рассчета Суммы НДС.
//
Функция ВернутьСтавкуНДС(СтавкаНДС)
	
	Если СтавкаНДС = Перечисления.СтавкиНДС.НДС10 Тогда
		Ставка = 10;
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС18 Тогда
		Ставка = 18;
	Иначе
		Ставка = 0;
	КонецЕсли;
	
	Возврат Ставка;
	
КонецФункции

#КонецОбласти
